## SQLite-tehtävät

Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [99]:
import pandas as pd
import sqlite3
database_connection = sqlite3.connect('testi.db')

Luo yhteys tietokantaan

In [100]:
c = database_connection.cursor()

Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [101]:
c.execute('''CREATE TABLE henkilotaulu
             (Nimi, Ika, Kengankoko)''')
example_data_rows = [("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37)]
for data_row in example_data_rows:
    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))
database_connection.commit()

In [102]:
sql_query = '''SELECT * FROM henkilotaulu'''
dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)
dataframe_from_sqlite

    Nimi  Ika  Kengankoko
0  Teppo   88          47
1  Matti   34          39
2  Ilona   41          36
3  Sonja   32          37

Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [103]:
c.execute('''CREATE TABLE henkilotaulu_uusi
             (Nimi, Ika, Kengankoko,Hatunkoko)''')
example_data_rows = [("Teppo", 88, 47,23), ("Matti", 34, 39,34), ("Ilona", 41, 36,45), ("Sonja", 32, 37,56)]
for data_row in example_data_rows:
    c.execute('''INSERT INTO henkilotaulu_uusi VALUES {0}'''.format(data_row))
database_connection.commit()

In [104]:
sql_query = '''SELECT * FROM henkilotaulu_uusi'''
dataframe_from_sqlite2 = pd.read_sql(sql_query, database_connection)
dataframe_from_sqlite2

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         23
1  Matti   34          39         34
2  Ilona   41          36         45
3  Sonja   32          37         56

Tee taulusta kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla

In [105]:
henkilotaulukopio=dataframe_from_sqlite2.append(pd.DataFrame({"Nimi":["saara"],
                                                             "Ika":["44"],
                                                             "Kengankoko":["38"],
                                                             "Hatunkoko":["56"]}))
henkilotaulukopio

    Nimi Ika Kengankoko Hatunkoko
0  Teppo  88         47        23
1  Matti  34         39        34
2  Ilona  41         36        45
3  Sonja  32         37        56
0  saara  44         38        56

 Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [106]:
database_connection.commit()
database_connection.close()